In [1]:
# Import libraries

In [2]:
'''import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

matplotlib.rcParams['figure.figsize']= (20,10)'''

"import pandas as pd\nimport numpy as np\nimport matplotlib.pyplot as plt\n%matplotlib inline\n\nmatplotlib.rcParams['figure.figsize']= (20,10)"

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams['figure.figsize']= (20,10)

In [4]:
## Data Loading

In [5]:
df = pd.read_csv('bengaluru_house_prices.csv')

In [6]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [7]:
df.shape

(13320, 9)

In [8]:
## Let's see areatype and it's count

In [9]:
 df.groupby('area_type')

In [10]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [11]:
## To make our model simple we will drop some feature or column

In [12]:
df1 = df.drop(['area_type', 'availability', 'society', 'balcony'], axis='columns')

In [13]:
df1.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [14]:
## Now let's start data Cleaning

In [15]:
## We will first start by finding na values

In [16]:
df1.isnull()

       location   size  total_sqft   bath  price
0         False  False       False  False  False
1         False  False       False  False  False
2         False  False       False  False  False
3         False  False       False  False  False
4         False  False       False  False  False
...         ...    ...         ...    ...    ...
13315     False  False       False  False  False
13316     False  False       False  False  False
13317     False  False       False  False  False
13318     False  False       False  False  False
13319     False  False       False  False  False

[13320 rows x 5 columns]

In [17]:
df1.isnull().any()

location       True
size           True
total_sqft    False
bath           True
price         False
dtype: bool

In [18]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [19]:
##As we can see there is very less number of na values so we can drop them
## If it is large than we can substitute it with mean, median or mode

In [20]:
df2 = df1.dropna()

In [21]:
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [22]:
df2.shape

(13246, 5)

In [23]:
## In size column there are some values as 3 BHK and some value as 4 bedroom

In [24]:
## Let's see how much different type of value size column has

In [25]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [26]:
## here we can see that 4BHk and 4 bedrrom are same

In [27]:
## Let's create a new column which contain only number of bedrrom or bhk

In [28]:
df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\Admin\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [29]:
df2.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [30]:
df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\Admin\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [31]:
df2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [32]:
df2[df2.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [33]:
## In 2400 sqrft it is not possible to make 43 rooms there is something wrong
## we have to handle this type of problem

In [34]:
## Let's explore total_sqrft column

In [35]:
df2['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [36]:
## we can see there are some values which has value as range
## we can handle that problem by replacing that value with the average of that eange

In [37]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [38]:
df2['total_sqft'].apply(is_float)

0        True
1        True
2        True
3        True
4        True
         ...
13315    True
13316    True
13317    True
13318    True
13319    True
Name: total_sqft, Length: 13246, dtype: bool

In [39]:
## But we need numbers

In [40]:
df2[~df2['total_sqft'].apply(is_float)]

                 location   size   total_sqft  bath    price  bhk
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800    2
...                   ...    ...          ...   ...      ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000    3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500    4

[190 rows x 6 columns]

In [41]:
df2[~df2['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  bhk
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [42]:
## To handle this problem we for range we take average of that range and replace by range value
## for the value such as meter, perch we ignore those rows

In [43]:
def conv_sqrft_to_num(x):
    token = x.split('-')
    if len(token)==2:
        return (float(token[0])+float(token[1]))/2
    try:
        return float(x)
    except: 
        return None

In [44]:
conv_sqrft_to_num('216')

216.0

In [45]:
conv_sqrft_to_num('2100 - 2850')

2475.0

In [46]:
conv_sqrft_to_num('34.46Sq. Meter')

In [47]:
# Now let's apply our function to dataset

In [48]:
df3 = df2.copy()

In [49]:
df3['total_sqft'] = df3['total_sqft'].apply(conv_sqrft_to_num)

In [50]:
df3.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [51]:
## let's access index 30

In [52]:
df3.loc[30]

location      Yelahanka
size              4 BHK
total_sqft         2475
bath                  4
price               186
bhk                   4
Name: 30, dtype: object

## In this lectuure we will see Feature engeneering and dimensionality reduction

In [53]:
df3.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [54]:
df4 = df3.copy()

In [55]:
## Now we will create price per square fit

In [56]:
## We will do feature engeneering and will create new feature

In [57]:
df4['per_sqr_feet'] = df4['price']*100000/df4['total_sqft']

In [58]:
df4.head()

,location,size,total_sqft,bath,price,bhk,per_sqr_feet
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [59]:
## Now let's take a look on location column

In [60]:
## we will see there are how many locations in location column

In [61]:
## location column  contain catagorical value

In [62]:
##if we have two many location then it can create problem

In [63]:
df4.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [64]:
#df4.location.unique().count()

In [65]:
len(df4.location.unique())

1304

In [66]:
## We have 1300 location which is big number 
## basically we handle the Catagorical data with one hot encoding by converting them into dummy variable

In [67]:
## If we keep all the data then one hot encoding will make around 1300 column that means too much column

In [68]:
## This is called as curse of dimensionality
## OR this is high dimensionality problem

In [69]:
## Thre are techniques to reduce the dimensions

In [70]:
df4.location = df4.location.apply(lambda x: x.strip())

In [71]:
location_stat = df4.groupby('location')['location'].agg('count')

In [72]:
location_stat.head(20)

location
1 Annasandrapalya                                   1
1 Giri Nagar                                        1
1 Immadihalli                                       1
1 Ramamurthy Nagar                                  1
12th cross srinivas nagar banshankari 3rd stage     1
1A Block Koramangala                                1
1Channasandra                                       1
1Hanuman Nagar                                      1
1Hoysalanagar                                       1
1Kasavanhalli                                       1
1st Block BEL Layout                                2
1st Block HBR Layout                                3
1st Block HRBR Layout                               8
1st Block Jayanagar                                14
1st Block Koramangala                              10
1st Phase JP Nagar                                 25
1st Stage Domlur                                    1
1st Stage Indira Nagar                              5
1st Stage Radha Krishna Layout                      1
2 Bedroom Furnished Farm House in Kolar Road        1
Name: location, dtype: int64

In [73]:
location_stat = df4.groupby('location')['location'].agg('count').sort_values(ascending=False)

In [74]:
location_stat.head(60)

location
Whitefield                  535
Sarjapur  Road              392
Electronic City             304
Kanakpura Road              266
Thanisandra                 236
Yelahanka                   210
Uttarahalli                 186
Hebbal                      176
Marathahalli                175
Raja Rajeshwari Nagar       171
Bannerghatta Road           152
Hennur Road                 150
7th Phase JP Nagar          149
Haralur Road                141
Electronic City Phase II    131
Rajaji Nagar                106
Chandapura                   98
Bellandur                    96
Hoodi                        88
KR Puram                     88
Electronics City Phase 1     87
Yeshwanthpur                 85
Begur Road                   84
Sarjapur                     81
Kasavanhalli                 79
Harlur                       79
Banashankari                 74
Hormavu                      74
Kengeri                      73
Ramamurthy Nagar             73
Koramangala                  72
Hosa Road                    72
Old Madras Road              70
Varthur                      70
Jakkur                       68
JP Nagar                     67
Kothanur                     66
Kaggadasapura                64
Nagarbhavi                   63
Thigalarapalya               62
Akshaya Nagar                62
TC Palaya                    60
Rachenahalli                 58
8th Phase JP Nagar           57
Malleshwaram                 57
Budigere                     54
HSR Layout                   53
Hulimavu                     52
Jalahalli                    52
Jigani                       52
Hennur                       52
Bisuvanahalli                51
Panathur                     51
Ramagondanahalli             50
Hegde Nagar                  49
Bhoganhalli                  49
Gottigere                    48
Mysore Road                  48
Brookefield                  47
Kundalahalli                 47
Name: location, dtype: int64

In [75]:
## This means location 'Whitefield ' has 535 rows

In [76]:
## There are multiple location which has only one row 
## so we can sort them

In [77]:
## Let's see how many location have less than 10 data points

<h2 style="color:blue">Dimensionality Reduction</h2>

**Any location having less than 10 data points should be tagged as "other" location. This way number of categories can be reduced by huge amount. Later on when we do one hot encoding, it will help us with having fewer dummy columns**

In [78]:
len(location_stat[location_stat<=10])

1052

In [79]:
location_stat_less_than_10 = (location_stat[location_stat<=10])

In [80]:
location_stat_less_than_10.head(60)

location
BTM 1st Stage               10
Basapura                    10
Sector 1 HSR Layout         10
Naganathapura               10
Kalkere                     10
Nagadevanahalli             10
Nagappa Reddy Layout        10
Sadashiva Nagar             10
Gunjur Palya                10
Dairy Circle                10
Ganga Nagar                 10
Dodsworth Layout            10
1st Block Koramangala       10
Chandra Layout               9
Jakkur Plantation            9
2nd Phase JP Nagar           9
Yemlur                       9
Mathikere                    9
Medahalli                    9
Volagerekallahalli           9
4th Block Koramangala        9
Vishwanatha Nagenahalli      9
B Narayanapura               9
KUDLU MAIN ROAD              9
Ejipura                      9
Vignana Nagar                9
Peenya                       9
Kaverappa Layout             9
Banagiri Nagar               9
Gollahalli                   9
Kamakshipalya                9
Richmond Town                9
Chennammana Kere             9
Lingarajapuram               9
Hoysalanagar                 8
Dodda Nekkundi Extension     8
Jalahalli West               8
Manayata Tech Park           8
Akshayanagara East           8
Akshaya Vana                 8
Basavanapura                 8
Byadarahalli                 8
Kodbisanhalli                8
Dollars Colony               8
Sidedahalli                  8
Sarjapur Road,               8
Hongasandra                  8
Sathya Sai Layout            8
Shikaripalya                 8
Nallurhalli                  8
Shanti Nagar                 8
Thirumenahalli               8
Kattigenahalli               8
Gopalkrishna Nagar           8
Vasanth nagar                8
Nelamangala                  8
Outer Ring Road East         8
Kanaka Nagar                 8
Seetharampalya               8
Vajarahalli                  8
Name: location, dtype: int64

In [81]:
len(df4.location.unique())

1293

In [82]:
df4.location = df4.location.apply(lambda x: 'other' if x in location_stat_less_than_10 else x)
len(df4.location.unique())

242

In [83]:
df4.head(10)

,location,size,total_sqft,bath,price,bhk,per_sqr_feet
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804

In [84]:
# SO Now when we convert it using onehot encoding now there will be only 216 column

### Outliers

In [ ]:
Outliers are the extreme var